socialNetwork/jaeger_traces/limit_socnetapp_user-service/traces_0.6.log
Running 30s test @ http://ms1311.utah.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 14.437ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 16.019ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 14.855ms, rate sampling interval: 44ms
  Thread calibration: mean lat.: 14.252ms, rate sampling interval: 39ms
  Thread calibration: mean lat.: 15.180ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 14.767ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 14.820ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 14.363ms, rate sampling interval: 41ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://ms1311.utah.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    16.05ms    9.50ms  50.33ms   94.23%
    Req/Sec    24.48     24.69   100.00     89.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.28ms
 75.000%   17.85ms
 90.000%   21.92ms
 99.000%   50.33ms
 99.900%  134.01ms
 99.990%  150.27ms
 99.999%  150.27ms
100.000%  150.27ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.003     0.000000            1         1.00
      10.079     0.100000          391         1.11
      11.047     0.200000          784         1.25
      12.023     0.300000         1170         1.43
      13.159     0.400000         1561         1.67
      14.279     0.500000         1950         2.00
      14.927     0.550000         2147         2.22
      15.551     0.600000         2339         2.50
      16.311     0.650000         2535         2.86
      17.007     0.700000         2733         3.33
      17.855     0.750000         2923         4.00
      18.335     0.775000         3021         4.44
      18.927     0.800000         3118         5.00
      19.503     0.825000         3219         5.71
      20.143     0.850000         3314         6.67
      20.975     0.875000         3410         8.00
      21.471     0.887500         3460         8.89
      21.935     0.900000         3508        10.00
      22.671     0.912500         3557        11.43
      23.551     0.925000         3605        13.33
      24.671     0.937500         3654        16.00
      25.583     0.943750         3678        17.78
      26.367     0.950000         3703        20.00
      27.503     0.956250         3727        22.86
      28.687     0.962500         3751        26.67
      30.799     0.968750         3776        32.00
      32.287     0.971875         3789        35.56
      33.375     0.975000         3800        40.00
      35.423     0.978125         3812        45.71
      37.471     0.981250         3824        53.33
      40.767     0.984375         3837        64.00
      41.791     0.985938         3843        71.11
      42.591     0.987500         3850        80.00
      47.743     0.989062         3855        91.43
      55.615     0.990625         3861       106.67
      61.503     0.992188         3867       128.00
      61.695     0.992969         3870       142.22
      64.799     0.993750         3873       160.00
      73.343     0.994531         3876       182.86
      78.591     0.995313         3879       213.33
      83.903     0.996094         3882       256.00
      96.255     0.996484         3884       284.44
     101.247     0.996875         3885       320.00
     108.031     0.997266         3887       365.71
     116.607     0.997656         3888       426.67
     122.175     0.998047         3890       512.00
     122.495     0.998242         3891       568.89
     122.495     0.998437         3891       640.00
     127.487     0.998633         3892       731.43
     134.015     0.998828         3893       853.33
     137.471     0.999023         3894      1024.00
     137.471     0.999121         3894      1137.78
     137.471     0.999219         3894      1280.00
     145.535     0.999316         3895      1462.86
     145.535     0.999414         3895      1706.67
     145.791     0.999512         3896      2048.00
     145.791     0.999561         3896      2275.56
     145.791     0.999609         3896      2560.00
     145.791     0.999658         3896      2925.71
     145.791     0.999707         3896      3413.33
     150.271     0.999756         3897      4096.00
     150.271     1.000000         3897          inf
#[Mean    =       16.051, StdDeviation   =        9.497]
#[Max     =      150.144, Total count    =         3897]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5846 requests in 30.06s, 1.20MB read
  Socket errors: connect 0, read 0, write 0, timeout 9497
Requests/sec:    194.47  
Transfer/sec:     40.83KB